cases/mesh_study/medium/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (10 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            slip;
    }

    upperWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}
